// import styles from '../../styles/About.module.css'
import styles from "@/styles/about.module.css"

function About() {
   return (
      <div className="container">
         <div className={styles.aboutContainer}>
            <h4>تاریخپه مقداد آی تی (بیش از یک دهه سابقه درخشان)</h4>
            <p>
               مجموعه مقداد آی تی - یکی از اولین و معتبر ترین فروشگاه های آنلاین کشور- در آغاز با
               فروش عمده قطعات کامپیوتر و لپ تاپ، کار خود را آغاز نمود. بعد از موفقیت و جلب رضایت
               مشتریان با نیاز سنجی و درایت مدیریت محترم، تصمیم به خدمت رسانی به تمام هموطنان در
               سراسر ایران عزیزمان گرفت که در راستای این سیاست گذاری، سایت Meghdadit.com در سال 1386
               راه اندازی گردید.
            </p>

            <h4>سرزمین کالاها و قطعات الکترونیک (انتخاب بهترین برندها برای خرید اینترنتی شما)</h4>
            <p>
               فروشگاه اینترنتی مقداد آی تی، بدون شک بهترین گزینه برای خرید اینترنتی شما در میهن
               پهناورمان ایران است. تمامی ایرانیان می توانند کالاهای الکترونیک مورد نیاز خود از قبیل
               لپتاپ، موبایل ، تبلت، قطعات کامپیوتر، انواع ساعت های هوشمند و کنسول بازی، ماشین های
               اداری، لوازم جانبی ، لوازم خانگی و هزاران کالای متنوع را به صورت آنلاین خریداری کنند
               و به آسانی تحویل بگیرند. امکان تجربه خرید اینترنتی از معتبرترین برندهای دنیا همچون LG
               ، Apple، iPhone، ASUS ، LENOVO ، SONY ، SAMSUNG ، و چندین برندهای معتبر در بخش شبکه
               مثل Linksys, D-link, TP-LINK و در بخش لوازم جانبی مثل Creative, Xp, Genius,
               Microsoft, Farassoo,Tsco, A4tech, Logitech, و تحهیزات خنک کننده مثل Cooler Master,
               Enermax, Deep Cool ، یکی از امکانات بزرگ در سایت اینترنتی مقداد آی تی است که در جهت
               جلب رضایت مشتریان فراهم گردیده است.
            </p>

            <h4>هدف ما، تداوم رفاقت با شما</h4>
            <p>
               مهم ترین هدف ما در فروشگاه مقداد آی تی، جلب و حفظ رضایت شما دوستانی است که سرمایه های
               ارزشمند این فروشگاه محسوب می شوید. در برابر قیمت های متغیر و گاه غیرمنصفانه بازار، ما
               در کنار شما هستیم و همواره در تلاشیم تا کالاهای با کیفیت را با گارانتی معتبر و به
               نازل ترین قیمت در دسترس شما عزیزان قرار دهیم. در مقداد آی تی به معنای واقعی کلمه،
               همیشه حق با مشتری است.
            </p>

            <h4>یک چشم انداز بزرگ برای ایران بزرگ</h4>
            <p>
               چشم انداز این فروشگاه «مرکز خرید 20 میلیون ایرانی» است و با تکیه بر اصول اخلاقی و
               ایجاد رابطه‌ای بادوام با مشتری، سعی دارد تا همواره حافظ ارزش پول مشتریان هنگام خرید
               از مقداد آی تی باشد. شما می توانید به صورت آنلاین کالای مورد نظر خود را مشاهده و
               اطلاعات فنی دستگاه را دریافت و در صورت تمایل اقدام به خرید نمایید.
            </p>

            <h4>مجوزها و گواهی نامه ها</h4>
            <p>
               لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان
               گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و
               برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی
               می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و
               متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
               الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید
               داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان
               مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود
               طراحی اساسا مورد استفاده قرار گیرد.
            </p>
         </div>
      </div>
   )
}
export default About
