import User from "@/models/User";
import connectDB from "@/utils/connectDB";
import bcrypt from "bcrypt";
export default async function Handler(req, res) {
  //چک کرد متد
  if (req.method != "POST") {
    return res.status(405).json({ message: "متد مجاز نیست" });
  }

  try {
    //اعتبار سنجی مقادیر دریافتی
    const { firstName, lastName, email, password } = req.body;
    if (
      !firstName.trim() ||
      !lastName.trim() ||
      !email.trim() ||
      !password.trim()
    ) {
      return res.status(422).json({ message: "لطفا همه فیلدهارا تکمیل کنید" });
    }

    //چک کردن طول پسوورد
    if (password.length < 8 || password.length > 20) {
      return res
        .status(422)
        .json({ message: "طول پسوورد باید بین 8 و 20 کاراکتر باشد" });
    }

    //چک کردن ساختار ایمیل درست باشد
    const emailRegex = /^[a-zA-Z0-9._%+-]+@gmail\.com$/i;
    if (!emailRegex.test(email)) {
      return res.status(422).json({ message: "ساختار جیمیل اشتباه است" });
    }

    //اتصال به دیتابیس
    await connectDB();

    //چک کردن ایمیل تکراری نباشد
    const isUserExist = await User.findOne({ email });
    if (isUserExist) {
      return res
        .status(409)
        .json({ message: "این ایمیل قبلا در سایت ثبت نام کرده است" });
    }

    //هش کردن و رمز رنگاری کردن پسوورد کاربر
    //برای ذخیره در دیتابیس
    const hashedPassword = await bcrypt.hash(password, 10);
    //در ورودی اول پسووردی که باید هش بکنیم
    //رو بهش میدیک
    //در ورودی دوم یک عدد میدیم که نشان دهنده
    //پیچیدگی رمزنگاریه
    //هرچه عدد بزرگتری بدیم
    //رمزنگاری پیچیده تری
    //انجام میشه
    //هرچه عدد بزرگتری بدیم سرعت رمزنگاری کاهش
    //پیدا میکنه
    // مقدار پیشفرض عدد 10 هست
    // اویت رو هم قرار میدیم چونکه هملیات
    //هش کردن یک عملیات زمان بر هست

    //تعیین نقش کاربر
    //اولین کاربر ثبت نام کننده ادمین است
    //مابقی یوزر معمولی هستند
    const countUsers = await User.countDocuments();
    //اگه مقدار کانت یوزر بیشتر از صفر بود
    //یعنی قبلا کاربری ثبت نام کرده پس
    //در یوزر کری ایت بر اساس کانت یوزر
    //تصمیم میگیریم که کاربر جدید مقدار رولش یعنی
    //نقشش یوزر باشه یا ادمین

    //در نهایت اگه تمام شرط های
    //بالا برقرار نبود
    //و تمام فیلد ها مقدار داشت
    //و ایمیل تکراری نداشتیم
    //کاربر را ثبت نام میکنیم
    try {
      await User.create({
        ...req.body,
        password: hashedPassword,
        role: countUsers > 0 ? "user" : "admin",
      });
      res.status(201).json({ message: "کاربر با موفقیت ثبت نام شد" });
    } catch (error) {
      const { firstName, lastName, email, password } = error.errors;
      // حالا این آبجکت‌ها رو می‌ریزیم داخل یه آرایه
      // ولی فقط اون‌هایی که واقعا وجود دارن (یعنی نال نیستن)
      const errorArray = [firstName, lastName, email, password].filter(Boolean);
      res.status(422).json(errorArray);
    }
  } catch (err) {
    res.status(500).json({ message: "مشکلی در سرور به وجود امده" });
  }
}
//localhost:port/api/auth/register

//در این کالکشن فقط متد پست برای ریکویست
//را قبول مکنیم بنابر این مینویسیم
//اگر متد ریکوست دریافتی چیزی غیر از
//متد پست بود
//ریسپانس با کد وضعیت 405 رو بفرست
//اید کد وضعیت یعنی متد مجاز نیست
//و یک پیام هم میفرستیم و مینویسیم متد مجاز نیست

//سپس در اعتبار سنجی مقادیر دریافتی
//ابتدا چک میکنیم که حتی اگر یکی از
//فیلدهای دریافتی مقدار نداشت
//ارور 422 برای فرانت بفرسته و بگه که
//لطفا همه فیلدها را پر کنید

//برای اینکه چک کنیم ایمیل وارد شده
//از قبل درون دیتابیسمون وجود داره یا نه
//مدل یوزرمون رو که ساختیم ایمپورت میکنیم
//و فایند ان روش اجرا میکنیم
//و پراپرتی ایمیل رو هم بهش میدیم
// اگر پراپرتی ای مشابه ایمیل
//وجود داشت اون ایمیل رو ریترن میکنه درون ثابت
//اگر ایمیلی مشابهش وجود نداشت
// چیزی ریترن نمیشه و مقدار ثابت نال میمونه
// پس بر اساس مقدار ثابت  تصمیم میگیریم که
//ایمیل وارده قبلا در دیتا بیسمون وجود داشته
//یا که نه
//اگر ایمیلی وجود داشت در دیتابیس
//کد وضعیت 409 یعنی تداخل رو میفرستیم
// و مینویسیم این ایمیل قبلا در سایت ثبت نام
// کرده است

//عملیات اضاقه کردن ابجکت به دیتابیس
//رو درون تری و کتچ مینویسیم تا که
//ارورهای ساختار داده ای پکیج مونگو دی بی
//اگه دریافت شد عملیات درون کتچ
// اتفاق بیفته و پیام خطا برای فرانت
//فرستاده بشه
